Microchip-MPLAB-Harmony/bootloader/apps/i2c_bootloader/bootloader_wlcsp/firmware/src/packs/ATSAMD20E15BU_DFP/component/ac.h
/* -------- AC_SCALER : (AC Offset: 0x20) (R/W 8) Scaler n -------- */
#define AC_SCALER_RESETVALUE                  _U_(0x00)                                            /**<  (AC_SCALER) Scaler n  Reset Value */

#define AC_SCALER_VALUE_Pos                   _U_(0)                                               /**< (AC_SCALER) Scaler Value Position */
#define AC_SCALER_VALUE_Msk                   (_U_(0x3F) << AC_SCALER_VALUE_Pos)                   /**< (AC_SCALER) Scaler Value Mask */
#define AC_SCALER_VALUE(value)                (AC_SCALER_VALUE_Msk & ((value) << AC_SCALER_VALUE_Pos))
#define AC_SCALER_Msk                         _U_(0x3F)                                            /**< (AC_SCALER) Register Mask  */


/** \brief AC register offsets definitions */
#define AC_CTRLA_REG_OFST              (0x00)              /**< (AC_CTRLA) Control A Offset */
#define AC_CTRLB_REG_OFST              (0x01)              /**< (AC_CTRLB) Control B Offset */
#define AC_EVCTRL_REG_OFST             (0x02)              /**< (AC_EVCTRL) Event Control Offset */
#define AC_INTENCLR_REG_OFST           (0x04)              /**< (AC_INTENCLR) Interrupt Enable Clear Offset */
#define AC_INTENSET_REG_OFST           (0x05)              /**< (AC_INTENSET) Interrupt Enable Set Offset */
#define AC_INTFLAG_REG_OFST            (0x06)              /**< (AC_INTFLAG) Interrupt Flag Status and Clear Offset */
#define AC_STATUSA_REG_OFST            (0x08)              /**< (AC_STATUSA) Status A Offset */
#define AC_STATUSB_REG_OFST            (0x09)              /**< (AC_STATUSB) Status B Offset */
#define AC_STATUSC_REG_OFST            (0x0A)              /**< (AC_STATUSC) Status C Offset */
#define AC_WINCTRL_REG_OFST            (0x0C)              /**< (AC_WINCTRL) Window Control Offset */
#define AC_COMPCTRL_REG_OFST           (0x10)              /**< (AC_COMPCTRL) Comparator Control n Offset */
#define AC_SCALER_REG_OFST             (0x20)              /**< (AC_SCALER) Scaler n Offset */

#if !(defined(__ASSEMBLER__) || defined(__IAR_SYSTEMS_ASM__))
/** \brief AC register API structure */
typedef struct
{  /* Analog Comparators */
  __IO  uint8_t                        AC_CTRLA;           /**< Offset: 0x00 (R/W  8) Control A */
  __O   uint8_t                        AC_CTRLB;           /**< Offset: 0x01 ( /W  8) Control B */
  __IO  uint16_t                       AC_EVCTRL;          /**< Offset: 0x02 (R/W  16) Event Control */
  __IO  uint8_t                        AC_INTENCLR;        /**< Offset: 0x04 (R/W  8) Interrupt Enable Clear */
  __IO  uint8_t                        AC_INTENSET;        /**< Offset: 0x05 (R/W  8) Interrupt Enable Set */
  __IO  uint8_t                        AC_INTFLAG;         /**< Offset: 0x06 (R/W  8) Interrupt Flag Status and Clear */
  __I   uint8_t                        Reserved1[0x01];
  __I   uint8_t                        AC_STATUSA;         /**< Offset: 0x08 (R/   8) Status A */
  __I   uint8_t                        AC_STATUSB;         /**< Offset: 0x09 (R/   8) Status B */
  __I   uint8_t                        AC_STATUSC;         /**< Offset: 0x0A (R/   8) Status C */
  __I   uint8_t                        Reserved2[0x01];
  __IO  uint8_t                        AC_WINCTRL;         /**< Offset: 0x0C (R/W  8) Window Control */
  __I   uint8_t                        Reserved3[0x03];
  __IO  uint32_t                       AC_COMPCTRL[2];     /**< Offset: 0x10 (R/W  32) Comparator Control n */
  __I   uint8_t                        Reserved4[0x08];
  __IO  uint8_t                        AC_SCALER[2];       /**< Offset: 0x20 (R/W  8) Scaler n */
} ac_registers_t;


#endif /* !(defined(__ASSEMBLER__) || defined(__IAR_SYSTEMS_ASM__)) */
#endif /* _SAMD20_AC_COMPONENT_H_ */
